In [42]:
import os
import sys

sys.path.append("../..")

import numpy as np
import pandas as pd

from mikasa.io import load_pickle, dump_pickle

In [43]:
train = pd.read_csv("../data/raw/train.csv")
test = pd.read_csv("../data/raw/test.csv")
test['Survived'] = np.nan

data = pd.concat([train, test], axis=0)

In [44]:
print(data.shape)
data.head()

(1309, 12)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [45]:
data.dtypes

PassengerId      int64
Survived       float64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [62]:
# Cast types
data['Pclass'] = data['Pclass'].astype('O')

## Null Ratio

In [47]:
data.isnull().mean()

PassengerId    0.000000
Survived       0.319328
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.200917
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000764
Cabin          0.774637
Embarked       0.001528
dtype: float64

## Summary Stats

In [48]:
print("Object Describe:")
display(data.describe(include=['O']))

print("Numeric Describe:")
display(data.describe(include=['number']))

Object Describe:

        Pclass              Name   Sex    Ticket        Cabin Embarked
count     1309              1309  1309      1309          295     1307
unique       3              1307     2       929          186        3
top          3  Kelly, Mr. James  male  CA. 2343  C23 C25 C27        S
freq       709                 2   843        11            6      914

Numeric Describe:

,PassengerId,Survived,Age,SibSp,Parch,Fare
count,1309.000000,891.000000,1046.000000,1309.000000,1309.000000,1308.000000
mean,655.000000,0.383838,29.881138,0.498854,0.385027,33.295479
std,378.020061,0.486592,14.413493,1.041658,0.865560,51.758668
min,1.000000,0.000000,0.170000,0.000000,0.000000,0.000000
25%,328.000000,0.000000,21.000000,0.000000,0.000000,7.895800
50%,655.000000,0.000000,28.000000,0.000000,0.000000,14.454200
75%,982.000000,1.000000,39.000000,1.000000,0.000000,31.275000
max,1309.000000,1.000000,80.000000,8.000000,9.000000,512.329200

## Value Counts

In [49]:
data['Ticket'].value_counts().sort_values(ascending=False).head()

CA. 2343        11
1601             8
CA 2144          8
S.O.C. 14879     7
347082           7
Name: Ticket, dtype: int64

In [50]:
data['Cabin'].value_counts().sort_values(ascending=False).head()

C23 C25 C27        6
G6                 5
B57 B59 B63 B66    5
C22 C26            4
F4                 4
Name: Cabin, dtype: int64

In [51]:
data['Pclass'].value_counts().sort_index()

1    323
2    277
3    709
Name: Pclass, dtype: int64